D = int(input())

DP = [[0] * (D+1) for _ in range(8)]
# Index // 0: 정보관 1:전산관 2:미래관 3:신양관 4:한경직 5:진리관 6:형남공학관 7:학생회관
DP[0][0] = 1
for i in range(1, D+1):
    DP[0][i] = (DP[1][i-1] + DP[2][i-1]) % 1000000007
    # 정보관 = 전산관+미래관
    DP[1][i] = (DP[0][i-1] + DP[2][i-1] + DP[3][i-1]) % 1000000007
    # 전산관 = 정보관+미래관+신양관
    DP[2][i] = (DP[0][i-1] + DP[1][i-1] + DP[3][i-1] + DP[4][i-1]) % 1000000007
    # 미래관 = 정보관+전산관+신양관+한경직
    DP[3][i] = (DP[1][i-1] + DP[2][i-1] + DP[4][i-1] + DP[5][i-1]) % 1000000007
    # 신양관 = 전산관+미래관+한경직+진리관
    DP[4][i] = (DP[2][i-1] + DP[3][i-1] + DP[5][i-1] + DP[6][i-1]) % 1000000007
    # 한경직 = 미래관+신양관+진리관+형남
    DP[5][i] = (DP[3][i-1] + DP[4][i-1] + DP[7][i-1]) % 1000000007
    # 진리관 = 신양관+한경직+학생회관
    DP[6][i] = (DP[4][i-1] + DP[7][i-1]) % 1000000007
    # 형남 = 한경직+학생회관
    DP[7][i] = (DP[5][i-1] + DP[6][i-1]) % 1000000007
    # 학생회관 = 진리관+형남공학관

print(DP[0][D])